weeklong
bipartisan
sole
Franco-Belgian
An
record-breaking
two-week
abortive
front-page
central-bank
cautionary
four-month
strategic-arms
burly
two-hour
last-ditch
second-biggest
22-year-old
stock-ownership
ill-fated
19-year-old
five-day
five-month
month-to-month
early-morning
post-election
arms-for-hostages
17th-century
appeals-court
quintessential
non-binding
avid
eight-year-old
vice-presidential
unintended
eight-month
golden
U.S.-Canada
10-day
monthlong
consummate
keynote
anti-inflation
tacit
nine-month
year-long
virtual
30-day
undisclosed
14-year-old
scaled-down
every
reigning
an
definitive
13-year-old
consequent
credit-easing
uncanny
18-month
undisputed
plant-closings
longtime
A
33-year-old
eerie
six-year
sharp
long-awaited
Your
Another
23-year-old
immediate
40-year-old
seven-month
three-week
Nihon
balanced-budget
omnibus
12-year-old
debt-ceiling
nine-year-old
prime
affirmative
line-item
Cruzado
29-year-old
Senate-passed
belated
Keizai
lone
30-year-old
27-year-old
greatest
free-trade
white-haired
second-highest
all-out
shareholder-rights
single-day
31-year-old
terse
plant-closing
seven-year-old
year-to-year
grand-jury
her
two-year-old
two-day
nine-year
hapless
onetime
Any
10-month
self-styled
six-day
late-afternoon
25-year-old
any
long-running
talk-show
oil-price
tentative
inaugural
His
upper
final
35-year-old
10-year-old
lower-court
free-lance
long-standing
34-year-old
page-one
three-hour
one-day
discount-rate
one-vote
case-by-case
broadest
60-day
grand
three-day
another
patent-infringement
26-year-old
self-proclaimed
slightest
nearest
three-year-old
tax-overhaul
single
My
leveraged-buyout
wait-and-see
ultimate
six-week
House-passed
three-way
uphill
larger-than-expected
four-week
indefinite
interim
yearlong
one-week
million-share
concerted
Niagara
Jardine
Engineered
Brookings
Convenience
Overseas
Cato
Prudhoe
Sunshine
Dupont
L.F.
Student
Playtex
Highland
CB
Rental
Household
Weather
Telerate
Morgan
Population
Advanced
Royal
Witter
Fuji
Associated
Export
Missile
Equitable
Dallas-Fort
Conservation
Northern
Northwestern
Mutual
Kangyo
Dental
Airborne
Tufts
Environmental
&
Amnesty
Rutgers
Antitrust
MMS
Pepsi-Cola
Salomon
HOME
Wyse
Enterprise
National
Rural
Income
Memorial
Trinity
Cal
S.G.
Judicial
Hoare
FIRST
Appalachian
Tishman
Deposit
Contemporary
L.M.
Regional
Legal
Zacks
PETROLEUM
McClatchy
Taco
BRITISH
Des
Beech
Forecasting
Pearl
Asean
Fort
Norstar
Monetary
J.D.
Seagate
Selz
Dain
Real
Industrial
Cathay
Ltd.
Customs
Audubon
Rotary
Commonwealth
Scandinavia
Norsk
Brace
Corp.
Dominican
Vanguard
Omnicom
Basketball
Waste
Bear
Pitney
Imo
Greater
IDS
W
Citrus
Zoete
Retirement
Inertia
Triad
Inc.
Crop
Banana
Pinnacle
Benefit
INSURANCE
Hongkong
Westfield
Statistics
HOLDINGS
Purchasing
Asea
CMS
Sierra
Wells
Radiation
Mercury
Julius
RB
Sovran
Rank
Adelaide
FPL
Truck
Dean
Athletic
LSI
Broadview
Eighth
Tin
Psychiatric
Money
Business
Intelligent
Daytona
Legislative
GENERAL
Global
Glaxo
Ariel
Scientific
K
Carnegie-Mellon
Urban
Commercial
Pipe
Twentieth
Dinner
Traffic
Desert
Alco
Quad
SAVINGS
Pet
Cellular
Institut
Lehman
Brigham
Census
Football
Kawasaki
Modern
Battery
Public
Popular
Colt
Independent
AM
Box
Cancer
Moto
Jiffy
Forstmann-Leff
Ice
Maritime
Memory
Allstate
Magma
Americus
Harvard
Plain
Automobile
Palestine
Facilities
Human
Charming
Investor
Postal
Palm
Batterymarch
Educational
Puget
Statistical
Natural
Peoples
Biotech
Sumitomo
Harris
Applied
Oracle
Beverly
Silicon
Heavy
Westinghouse
PLM
Uniroyal
Leadership
Wah
Medical
Dutch/Shell
Baring
MOTOR
Sanwa
Provident
Turbine
Famous
MacMillan
Mental
General
Claremont
Menlo
Auto
Export-Import
Dartmouth
Offshore
Colonial
Wheelabrator
Intercontinental
IBJ
Golf
Great
Echo
Tender
Key
Dresdner
Dixie
Sporting
Outboard
Lake
Resource
DDB
Advisory
Scrimgeour
Tactical
Lloyds
Oval
Philipp
Internal
Tandem
Security
Kobe
Better
Kaneb
Lone
Storage
Argus
Advance
Jet
Buckeye
Corp
Westminster
R.J.
Iroquois
Flat
United
Central
'N
Kemper
Electronic
Patent
WEFA
Bankers
Italiana
Giant
Iron
Strategic
Secret
Gulfstream
Cape
Pizza
Travenol
Methodist
Sikorsky
Inspiration
Messerschmitt-Boelkow-Blohm
Wildlife
Immigration
Metropolitan
Specialty
Ground
Twin
H.F.
Creative
Parcel
Abbey
Journal/NBC
Carnegie
Southwestern
L.J.
Greenwell
Stanford
Kidder
Soo
Elk
Deutsche
Lazard
Inter-American
Analytical
Venture
High
Pension
Transco
Asset
Rocky
Johns
Animal
Ivy
Liz
Southern
Naval
MediaNews
Consulting
Sulzer
Overland
Pilots
Nippon
Comprehensive
Universal
E.F.
Atomic
Reliance
Accounting
Hartsfield
Flying
Certified
Quality
Franchise
Morning
Econometric
Transcontinental
Port
Wilshire
Kansai
Long-Term
Prebon
Rehabilitation
Investment
Galoob
Interpublic
IC
McDonnell
Balfour
Prudential
Barclays
ANR
Metro
Ex-Im
Related
Technical
Control
Alexanders
Ma
Joaquin
Convertible
Goldman
Automatic
Clean
Agricultural
IDD
Personnel
du
Ark
Dairy
Du
Value
CRS
Broadcast
Merrill
NATIONAL
Burnham
Information
Red
Barney
Manufacturers
Economic
Litton
Nesbitt
Coldwell
Landmark
Blackstone
Mitsui
Electrical
Toronto-Dominion
Yale
Interactive
Mitsubishi
First
J.C.
Bow
Multilateral
Blue
Hot
Free
Picture
Anchor
Forstmann
Shearson
Combustion
Thermo
CFM
Scandinavian
Liberation
Child
Consolidated
Clinical
Bantam
Ralston
Newport
Yamaichi
Daewoo
Home
Tiananmen
Graduate
Ideal
Visual
Emerald
Moet
Avondale
LaSalle
Cruise
Farm
Groupe
Federal
Rattigan
Hewlett-Packard
MacKay
Cincinnati
Galveston
Greve
Cousins
MBB
Orwell
Susman
Safra
Buckley
Ecuador
Terra
Bolivia
Duracell
Golden
B&C
Horsham
Kalikow
AID
Durenberger
Davison
Hoffenberg
Honda
Citadel
Mulford
CGE
NBD
Premark
Lyphomed
Sithe
Hollywood
Hecco
Winn
Kong
Polaroid
Alberto-Culver
Thousand
Diamandis
Owens-Corning
Olivetti
Granges
TransAmerican
Montreal
Decision
Maxxam
Wilder
Ogden
Australia
Aires
Clinton
Minneapolis
Guerin
PNC
Grey
Laurel
UMNO
Deak
Dulles
Warner-Lambert
Guam
Nordstrom
BioTechnica
Newell
Irving
NCNB
Duro-Test
Hudson
Steinberg
Rutland
CenTrust
Lantos
Comsat
LAC
WCRS
McCain
Vietnam
Royale
Bond
Estonia
Cenith
Greyhound
Microsoft
Amoskeag
Pannill
Illinois
Lionel
Bacot
Telefonica
Musicland
Antoniu
Tourism
Scherer
Jefferies
Giuliani
Joy
Sprague
Puma
Sequa
Ivanhoe
Peking
Manville
McArtor
Beecham
Vanderbilt
Tomorrow
Datapoint
Garment
Tiffany
Whitehall
ITT
Hart
Sage
Paris
Commerciale
Cecola
AMCA
Orion
Balanchine
Nixdorf
Metromedia
Mountleigh
Rica
Massey
Arden
MacGregor
Somerville
Havana
DEC
Lanier
Athens
Pinochet
Norwood
Arabian
Pepperell
Ledeen
Belo
Perth
OSHA
Thorn
Halliburton
Bates
Seidman
ADT
MCO
Monica
Time
Singer
Lego
Schlesinger
Pfeiffer
Albani
Renamo
Soni
Davenport
Liedtke
Cisneros
Barber
Goldome
Chubb
Princeville
Convergent
Canterra
Zurn
Vicorp
Gebauer
Suffield
Pelton
Payless
Gluck
Mengistu
McCaw
Chiron
Alpharel
Trudeau
MTV
Cubic
Eurotunnel
CSFB
Apex
Templeton
Hasbro
Lipper
KMS
Carberry
Corcoran
Hancock
DWG
Canadair
Rowntree
Pemex
Medco
Louis
Falconbridge
Lilco
BAA
InterTAN
Goodrich
Alpha
IV
Nader
Gandhi
Jepson
Brack
MIT
Eberstadt
Chrysler
Fronterhouse
Bellcore
Buntrock
Penny
Cie
Battelle
Zero
Cain
Colombo
Rust
Culverhouse
Icahn
Sorg
Galactic
Wolf
Marcos
Atari
Lonrho
BHC
India
sterling
Kennedy
Showboat
Yasuda
Ames
SmithKline
Savin
Seaman
Alyeska
Equiticorp
Allianz
Gap
Kean
Computervision
Curran
Francisco
Pilkington
Walsh
CFS
Durham
Cypress
Wendt
Spielvogel
Insilco
KKR
Solidarity
Baldrige
Siegan
TLC
Southdown
Brock
Trump
Azerbaijan
Woodstock
Baker
Pohlad
Lubrizol
Azhar
Trent
Unicorp
Entex
BankAmerica
Ohio
Audio/Video
facto
RKO
Socanav
UPS
Spinner
Hutchinson
Ferranti
Beregovoy
Schumer
Lufthansa
Repligen
Ghana
Denlea
Heck
Carney
Gannett
Hawley
Sloate
Carolco
Morocco
DeCrane
Hoylake
Mubarak
Denmark
Langley
Reno
Osaka
Poehl
Neptune
Perini
Sherritt
Fomon
Germany
Waxman
Kroger
Nigeria
Yemen
Maxus
Telemundo
Thatcher
Muldoon
Westin
Fiske
Beirut
Whirlpool
North
Graphic
Iowa
Comdata
Thailand
Panama
Jacinto
Vortec
Paribas
Oakite
Cleveland
Pathmark
CVN
Morosky
HBO
Foster
Oslo
ITG
Hulbert
Clines
Coffee
Marion
Micron
Dinkins
Paso
Lehder
PPG
Harcourt
Bigelow
Am
Manhattan
Hutchison
Aspin
Roadway
Gallo
Wilmington
Buckhorn
Blasius
Facet
Clair
Dravo
AmeriTrust
Atkins
Sheller-Globe
Lilly
Sandler
Alcan
America
Porsche
DeBartolo
BancTexas
LaRouche
Mansfield
KN
Tyson
Baghdad
Inco
GEC
Prospect
Alcoa
Magnet
MK
Hartz
Marble
Blackmun
B.A.T
Germain
Waldbaum
Drexel
Stroh
Cerus
Astrotech
Dodd
Borland
TSB
Assad
Galileo
Birmid
Varo
Hu
Pearlman
Mohawk
Presser
Duramed
Adelson
Drabinsky
Blumenthal
Glenfed
Nestle
Presidio
Galanis
Yetnikoff
Barnes
Kabul
Carolina
Bradley
Lyng
Basra
Riggs
Tri-State
Darby
Himont
Nast
Perella
Castro
Macy
Josephson
Dillon
CPC
Bolger
Pierce
Dresser
JMB
Sugarman
Comerica
Nashua
Varian
Magna
Craft
Morse
Munro
Freeman
Dingman
Brussels
Fusion
Beazer
Adelphia
Abboud
Duke
Jackson
Chelsea
Balcor
Wohlstetter
Worthington
Avia
Hinderliter
Queens
Scudder
Cilluffo
Spielberg
Ingram
Guatemala
Christi
Dialog
Allison
Ginn
KeyCorp
Singapore
Stalin
Portec
Conrad
Yokich
Ronson
Dallas
Minstar
Wang
Ashland
Tateho
Shuwa
Northgate
Maserati
Mendelson
Fedders
Byrd
Campbell
Conable
Duvalier
Sabine
BNL
Dofasco
Amfac
Jewelcor
Dingell
Purolator
Sun
Fujitsu
Delta
Geneva
Takeshita
Qintex
Blanchard
Rafsanjani
Dalton
Spectra
Phoenix
Mesa
Bush
Sanofi
DeNunzio
Basic
Checchi
Siegel
Oneok
Sydney
Hendry
Upjohn
Peachey
Warhol
Zico
MAC
Ansbacher
Acmat
Clore
Deloitte
MTM
Teleglobe
Victoria
Affiliated
Primerica
InterTan
Laidlaw
Laurentiis
Zhao
Thyssen
Depot
Investcorp
Calgary
Pereira
Stewart-Warner
Hemdale
Armenia
Bosch
Unigesco
Kirk
Patten
Sutton
Wendy
Huntington
Shevardnadze
Westmark
Reuben
McKesson
Allegheny
AirCal
Weinberger
Gwinnett
Barco
Towers
Summit
Northrop
Occidental
Suzuki
NRM
Malawi
Dickenson
Lawson
Seven-Up
Hawaii
Abramson
Bildner
Tulsa
Micom
Mellon
Perot
Mecca
Shad
Street
Araskog
Catalyst
Li
Banxquote
Acustar
Springsteen
Copley
Portugal
Switzerland
Reavis
Bass
Cuba
Safeway
Basix
Lamaur
Taplin
Dixons
Susquehanna
Arabia
Chen
Floating
Reed
Ching-kuo
Cruz
Mitterrand
Quotron
Atlas
O&Y
Kasten
Monroe
Hollis
Baxter
Carson
CREF
Andersen
Antonio
Gurit
Montedison
Laxalt
Connor
Sundstrand
Revlon
Infinity
Dorfman
Aloha
Summers
Crown
Moseley
Cray
Soweto
Blount
Abitibi
Broadway
Petersburg
Webb
Britain
Mulheren
Mosbacher
Palmieri
Lennon
Seidenberg
Conrail
Ford
Danforth
Bloomberg
Maytag
Kong-based
Dana
Disneyland
Triangle
Genisco
Guardia
Dobson
Aetna
Econocom
Burnley
Scanlon
Paramount
Maryland
Claus
Greenfield
Skinner
Robertson
Packwood
Eller
Delvalle
Packard
Filene
Biogen
Nantucket
Biden
Cenergy
Southland
Feith
BZW
Pilgrim
Sunrise
Wolverine
Stauffer
JAL
Stoneridge
Hesse
Montana
Thayer
Saab-Scania
A&M
Merritt
Genmar
Baylor
Faberge
Bright
Swearingen
Independence
Coniston
Roh
Shelton
Formica
Copenhagen
Buitoni
Columbus
Matra
Rouse
Ferraro
Gaylord
Idaho
SHV
Hare
Andres
Scotty
Mazda
Mondale
Madrid
Herrhausen
Airbus
Kellogg
Ankara
Rover
IBP
Prechter
Foote
LeBow
Hodel
Bloomingdale
Benedetti
Fuqua
Centel
Lafeyette
Lincoln
TPA
Cullinet
Tandy
Rough
Stanton
Sotheby
Enrico
JFK
UCLA
Showtime
Roosevelt
Higgins
Axa
Strobel
Commodore
Seelig
Kelvin
AmeriFirst
Pleasurama
Weisman
McMillan
Ashton-Tate
Alberta
CBS
LivingWell
CIT
CNN
Florence
Neuharth
Recruit
Detroit
Eagle-Picher
Kendall
Crocker
Capel
Sosnoff
Weill
Pyongyang
Freeport
Angeles-based
Malaysia
Acker
Dart
Kodak
Chili
Doskocil
Wonder
DSC
Capoten
Austria
Bethlehem
Haley
Westcoast
Mead
SafeCard
Lear
Knapp
Gould
Lever
Africa
McFarlane
Arkin
Finland
Grambling
Alley
Milan
Imreg
GMAC
Carteret
Mississippi
Pennsylvania
Tandon
Rican
Soros
Fleming
Olson
Callahan
Furr
Placid
Intergraph
Connally
Devon
Lugar
Borden
Indonesia
Sununu
Crownx
Hearst
Salant
Chappell
Walesa
Aviv
Brookehill
Parnes
Goode
Campeau
Weirton
Pelican
Kluge
Saskatchewan
Colombia
Eureka
Hi-Shear
Janeiro
Autolatina
Pell
Franklin
Rockefeller
McLean
Webster
Erbamont
Spoor
Finkelstein
Bahrain
Alitalia
Wasserman
Daimler
Ueberroth
Wesray
Heileman
ASK
Racal
Hakim
Radice
Barker
Ozark
Donnell
Lorean
LIPA
Nazer
Cullinane
Alzheimer
Taipei
Vernitron
Assubel-Vie
Matheson
Medalist
Florida
Woodward
Denver
NatWest
Clements
Seib
Shamir
Seville
Wright
Glasgow
USAir
Calvert
Ensource
CAP
Billboard
Gateway
Bayer
Kuhns
Saab
Vitro
Frankfurt
Lucas
Syria
Leeds
Benlox
Borg-Warner
Quadrex
Addison
Noriega
Baytree
TMIC
Shamrock
Nevada
Atwood
Midway
Hyatt
Micro
INDEXES
Chun
BCI
Tosco
Seabrook
Romania
Oklahoma
Squibb
Salvador
Israel
Panhandle
Genstar
Trafalgar
Hallwood
Rolls
Chad
Morehouse
Bryson
Hallmark
Iran
Rostenkowski
Lankan
Carlyle
Ireland
Revco
Koch
Gearhart
Actmedia
AFG
Fischbach
Aquitaine
Brierley
Wynn
IMC
Burt
Shannon
Trupin
Wigton
Tropicana
Bradt
Wisconsin
Carlin
CSR
Garth
Penthouse
Akzo
Roderick
Waldron
Neco
Isuzu
Moog
Boesky
Chandler
Xoma
TranStar
Kluwer
Tierney
Jamaica
Belgium
Honecker
Giorgio
Miami
Molly
Reichhold
Beker
Peres
Rubin
Nike
Punjab
Baucus
Macmillan
Plum
Fowler
Anheuser
Carlisle
Carter
Maine
Fidelity
Vancouver
Managua
Waters
Kerrey
Sawyer
Ghorbanifar
Denny
Hwan
Sasso
Grace
Zapata
Gunn
Alcatel
Milwaukee
CAE
Harbert
Owens
Virginia
Budapest
Chavin
Verity
Barcelona
Centex
Breeden
Bally
Hartley
Wallich
GAF
Cairo
Munich
Compaq
DeAngelis
BBDO
Komori
Fujisawa
Crow
Hovis
Herrlinger
AccuRay
UAP
Gutfreund
Berlin
Giacco
Italy
today
Dickens
Wrather
Steego
Seemala
Hauke
Geico
Elsevier
Firestone
Vienna
France
Arby
Compensation
CAA
Carrian
Baird
Bertelsmann
Envirodyne
Beneficial
Interco
Zenith
Chaumet
Washington
Dell
Adobe
Shultz
Garland
Hormel
Reuss
Eritrea
Paz
Howe
Stoddard
MCA
Pantera
Richman
McDonald
Eisenhower
Haiti
Lloyd
Johannesburg
Coleco
Ratners
Cherokee
Kristol
Zondervan
Bonneville
Colorado
Gdansk
Bavaria
Duarte
Cara
Midler
Industrielle
Nintendo
Logan
Norway
Volcker
Woolworth
Delchamps
Jerusalem
Rowan
Arias
Scalia
Gartner
Deng
Fleet/Norstar
Citibank
Clevite
Hawthorne
Crovitz
Collier
Altman
Monoclonal
Venezuela
Thurmond
Symbion
Alabama
Rico
Bonn
Girard
Todd
Arco
Murdock
MCorp
Peat
Unocal
Mecham
McKay
Pennzoil
ALC
Rolm
Tenneco
Bregman
Benham
Naples
Trimedyne
Lawn
Olin
Staley
Pittsburgh
Provigo
Turner
Herrington
Gesell
ESPN
Hawkeye
Koppers
Tunisia
Hachette
Antar
Mars
Cullum
Cineplex
Melridge
Liggett
Czechoslovakia
Swissair
Agee
Hillenbrand
Kinney
Polo
Coors
Myerson
Aristech
Quebec
Bombay
Indianapolis
Uspci
GPU
Bain
Benton
Cornell
Webber
Poland
BTR
Annenberg
Serrano
Genex
Kaifu
Dexter
Ontario
Dainippon
BellSouth
Compton
Edper
Abbott
Fogelman
Arvida
IRI
Belgique
Gemini
Tri-Star
Bricklin
Encor
Guinness
Wharton
Praxis
Smale
Champion
Eastern
WPP
Huffy
Maxwell
Parkin
Dole
Jefferson
Nobrega
Louis-based
Canon
Bolton
Ingersoll
Bench
Harlem
KLM
Cipollone
Daley
Simon
Humana
Darman
Newhall
Memorex
Augustine
Akers
Fe
Krupp
Ongpin
Centerior
Claire
Gore
Wheeling-Pittsburgh
us
Handy
Armey
Miyazawa
Yonkers
Bozell
Murdoch
MTech
Louisiana
Argyll
A&P
Apollo
AMC
Amstrad
Moet-Hennessy
Nakasone
Freud
ENI
Eye
Hibernia
Presidential
Fruehauf
Kentucky
Leath
SunGard
Fairchild
Karachi
Helms
Arkansas
Tokyo
Bakker
M.D.C.
Riney
Spectradyne
Aldus
Hudak
Ana
Heyman
Novelly
IBM
FDR
Maxicare
Durakon
Cosmopolitan
Reebok
Bilbao
Rainwater
PacifiCorp
Malley
Ladbroke
Enrile
English
Stegemeier
Salem
Dahl
Amoco
Pearson
Stockman
ABF
Sasson
Sanyo
Missouri
Nomad
Manitoba
Cadbury
Acme
Benson
Kamp
Clemente
Best
Ward
UAL
Burlington
Stafford
Russia
A&W
Opel
Honduras
them
Eastwood
Saint-Gobain
BOC
Cranston
Stratus
Cannon
Amgen
Donnelly
Continental
Tesoro
Gabelli
Jacobs
Oman
Pullman
McPherson
Ackerman
Burroughs-Wellcome
Chiang
Newmont
Pittston
Dakota
Siberia
Helmsley
Louisville
Fonda
Barre
Krieger
Fink
Neiman-Marcus
NCR
Foodmaker
Chieftain
DDI
CRT
Heublein
Malrite
Polygram
Winnebago
Wal-Mart
G&W
Namibia
Penrod
Kerkorian
NASA
Sunbelt
Equimark
Nicaragua
Sheraton
Crystal
Talley
Sand
Crosby
Bard
Afghanistan
LaRoche
Integrated
Sofer
Salinas
Alaska
Hydro-Quebec
ICN
CJI
Holly
IMA
Waite
Pueblo
Leningrad
Suez
Shakespeare
Clay
GPA
Ameritech
Gaubert
Pollack
Jenkins
Cuellar
Knoll
Polaris
IMS
NBI
Sihanouk
Paraguay
Browning-Ferris
Riordan
Livermore
Homestake
Suchard
Valukas
Bolar
Chugai
Fried
Europe
Vanuatu
Bork
Lanka
Kovach
Royex
Grenada
TI
Galbraith
Cash
Seow
Spain
NYU
Eisner
Nicklaus
Cosmos
Gillett
Mahathir
Atlanta
Alamo
Seagull
Beijing
Weintraub
Nebraska
Minpeco
Amtrak
Carrier
Nofziger
Blockbuster
Kohl
Paulo
Shoreham
Reichmann
Telemecanique
Vitarine
Wherehouse
Cambodia
Bentsen
Austin
Coke
Ne
Portland
Trumka
Outlet
Texaco
Mazowiecki
Sharp
Grolier
C.O.M.B.
Sarney
Spelling
Sourrouille
VW
Lebanon
Playboy
Grossman
Arvin
VLI
Arnault
Viacom
Gallup
Japan
Storehouse
Adams-Russell
Rollins
Rehnquist
Mayo
Cummins
UPI
Stanger
'88
Najibullah
Nixon
Liberty
Dover
Shell
Veba
Berisford
Argonaut
Oakes
Koop
Granada
Fine
itself
Havilland
Pepsi
Ortega
ZZZZ
Bamberger
Vernes
Linear
ATI
Esquire
MasterCard
Fairfax
Aquino
E.S.M.
Reeves
Henley
Hemingway
Rexnord
Clorox
Roemer
Hawke
Seattle
Nepal
Whitman
Avon
Greece
Artra
AST
Triton
Thornburgh
Burmah
Weston
Valu
Occidentale
Chi-Chi
Quantum
Regan
McDermott
Phelan
Hammer
Benequity
Argentina
Sunbeam
Hopkins
Canada
Santiago
Lotus
Redman
Moscow
Schenley
Angell
LTV
Bordeaux
Heathrow
Plaskett
Utah
Waldheim
Westwood
Luxembourg
CoreStates
Telesphere
Renault
Brokaw
Jakarta
Jem
Chile
Greene
Brennan
Kavner
Rabin
Transworld
McGillicuddy
TransCanada
Donoghue
Frost
Wyatt
Walbro
Seger
Galvin
Arizona
Hanoi
Barnett
Hertz
Plymouth
Avery
Cyclops
Abraham
Corona
Rangoon
Seoul
Nuveen
Sofaer
Juan
Fox
ChemLawn
Berlusconi
Ginsburg
Ladd
Zantac
Christie
Posner
Downey
Elf
Callender
Lasmo
GM
Cadnetix
Manila
Selkirk
Pesch
Oldsmobile
Winans
Stifel
Federated
Becor
Getty
CalMat
Cheney
Siemens
Brodersohn
Whitehead
CertainTeed
Newsweek
Leucadia
Casey
MSHA
Hamburg
Garn
Noel
Coen
Edelman
Eder
Pamour
Carnation
Burroughs
EDS
Pace
Wimbledon
Gortari
Farley
Texas
Robins
Peru
Nielsen
Zimbabwe
Agnelli
Subaru
Tisch
Parkinson
Novo
Gleason
Lange
Anadarko
Magnin
Dorsey
Hewlett
Bridges
Ambrosiano
ABC-TV
Proudfoot
UNC
Patlex
CCC
Whittle
Beebe
Paulson
Sigoloff
Memotec
Moody
GE
Kraft
Newton
Sikes
Dhabi
Roche
Arroyo
Papandreou
Backer
Basel
Bloom
Generali
Libya
Esber
Inland
Guez
Goodyear
DynCorp
Wickes
Rourke
Gull
Hollings
Plessey
Harnischfeger
Rue
Mozart
Cassoni
Damon
KaiserTech
Hammermill
Disney
Pritzker
Vogtle
Bangladesh
Children
Anita
Goldsmith
Lucky
Sweden
Pernod
Pirelli
Vons
Babbitt
Hicks
Stempel
Ponderosa
SSMC
Prism
Seymour
FNN
Towle
DeConcini
Goldstar
Griffin
Jaguar
Regis
Syncor
Munford
Healthdyne
Botha
Pandick
Point
Drucker
Deo
Beall
Penske
Noverco
Brasilia
Valencia
Saunders
Elle
Bundy
Alleco
Jolla
Lintas
Alpine
God
Laventhol
Beard
Keenan
Tricentrol
Calny
Telex
Korea
Centaur
Northview
Telxon
Hoover
Wedtech
Amcast
Parker
Britoil
Colby
Geothermal
Hungary
Ryder
Fokker
Allegis
Lube
Falwell
Funaro
Manzi
Worthen
Kyodo
Anglo
Anchorage
Argo
Wiley
Tsai
Kagan
Jupiter
Hees
Dreyer
Lima
Garcia
Dee
Armour
MSI
Proxmire
Banking
ARC
KMG
Allied-Lyons
Kinsley
Puttnam
Olivier
Pakistan
Lenin
Pullman-Peabody
Parisian
Beatrice
Indiana
Ducommun
Hyde
Cadwalader
Bernstein
C-I-L
Sharon
Bowen
BHP
Bushkin
Norden
GenCorp
Birmingham
MITI
Diego-based
Chariot
Reagan
Keating
Granville
Harken
Westburne
AGS
Fiat
Pillsbury
Bragg
Sandoz
Allied
Stockholm
Raymark
Gillette
Hitler
Shoney
CBI
Warner
Horizon
Gravitt
Wellington
Lindsey
Denison
Gemcraft
MDI
Millicom
Bracher
Bogota
TVX
Berkey
Rospatch
BDM
UTL
Culver
I.C.H.
Lorain
Chris-Craft
Pentane
USG
Wheeling
Mohasco
Seagram
Davidoff
Rowland
Sudbury
InterFirst
Citicorp
Gorbachev
Manpower
Nacco
Beech-Nut
Neworld
Vaskevitch
Rollwagen
Odyssey
Corpus
Mattel
Krebs
Plenum
Reuters
Lin
Neoax
Nissan
Kongsberg
Simmons
Fountain
Paine
Air
Farmer
Kenyon
Popejoy
Angeles
Jose
Perez
Rohr
Wilkis
Rorer
Alfin
Cooley
Dukakis
Rolland
Apple
Dubai
ETA
PSA
Laredo
Corrigan
Lorimar
Warwick
Maputo
McCall
Avis
Samsung
SunTrust
Ezell
Ensco
Buchsbaum
Menendez
Hatfield
Zambia
Wallenberg
Kenner
Rainier
Aramco
NL
Forbes
Cooper
Perle
GCA
Heinz
Brady
Donohue
Amdura
Alberthal
Lew
Holmes
Iraq
Exley
Sierracin
Minorco
Searle
Ariadne
Boatmen
Conquest
Palma
GC&C
Minkow
Monte
Stevens
Meier
SCEcorp
Arbor
Greenwood
IDC
Whittaker
Damascus
me
Esty
Redken
LaWare
Asia
ACI
Digital
Bowery
MAI
Paisley
Mathews
Hemlo
Navistar
Savimbi
Silberman
Channell
Allis
Woo
Amman
Oats
Mervyn
Prague
Zayre
Swaziland
Hull
Juarez
Kern
Barris
Pegasus
Rockwell
London
Storer
Wellcome
Queensland
Inter-City
Bulgaria
Hay
Weicker
Tuttle
Merhige
Merck
Vegas
Bangkok
Framatome
Vestron
Ozal
E-II
SCI
Eddie
Angola
Brooklyn
Raab
Alamco
Scotland
IU
Kinnear
Kinnock
Ruder
Husky
Bic
JWT
I.R.E.
Rooney
Comstock
Torell
Michaels
Rittereiser
Sands
Armtek
Furman
Bovard
MIPS
Kloeckner
Currey
Farmers
Theobald
PG&E
Houston
Carnival
Motown
Guilford
Minnesota
Dome
CDA
Chicago
Egypt
Baltimore
Copeland
Sculley
Razorback
Vermont
Alfonsin
Hurwitz
Westmoreland
Subroto
Taft
Sterba
Taubman
Wyoming
MCC
Figgie
3M
Zaire
Barron
Albertson
Caracas
D&B
Roper
OTF
Leysen
ABI
Ottawa
Alexander
Dillard
Newfoundland
Bullock
Gardini
Fireman
NATO
Tiger
TNT
Merkle
Rial
Centerre
Tyco
Gibraltar
Action
Colorocs
Yeutter
California
Arianespace
Magellan
BNS
P&G
Monsanto
Islamabad
Hewitt
Swift
Ingalls
Boitano
Biaggi
Gros
Haig
MGM/UA
Grassley
Prensa
Connecticut
Weld
Hanna
Braniff
Clancy
AIG
LIN
Princeton/Newport
Begley
Polysar
Tibet
Deukmejian
Alfa
Speyer
Rosewood
Recognition
Boland
Ferruzzi
Pennwalt
Guangdong
Asahi
PHLCorp
Meredith
Allegiance
Nevin
Monarch
Travers
China
Roux
Matrix
Deaver
Chase
McGill
McFarland
Hsiung
Banner
Mulroney
Locke
Fisk
Pontiac
Murkowski
Mexico
Nassau
Monterrey
Gitano
Midi
Fisons
Domino
Regina
Runyon
Uccel
Morrell
Alliant
Junger
Birnbaum
Rapids
Inouye
Midland
Congress
Rome
Vulcan
MeraBank
Bristol-Myers
Cluett
Clara
Kingsborough
Meritor
Windsor
Gerber
Riegle
City
GQ
Khashoggi
Poindexter
Rexham
Oliver
Pinola
Michelin
Hayward
UBS
Wheeler
Convex
Welch
Piedmont
Cawthorn
Kidde
Gaulle
Redstone
Mockler
Honolulu
Eastland
Chesebrough
Lapin
Kaskel
Ply-Gem
Unilever
Heusen
Bouygues
D&N
Gates
NBC
Sterling
Hughes
Colino
Mae
Montgomery
Hubbard
Jacoby
Westamerica
Mozambique
Petrie
NTT
SAS
Beers
Quayle
Exco
Amalgamated
Balladur
Cordis
Nokia
Caterpillar
Pickens
Keystone
Clayton
ComputerLand
Cockburn
Amway
Woodland
Istanbul
GranTree
Hershey
Ausimont
Oxdon
Spendthrift
Suharto
Tabor
Tennessee
Calero
Javelin
Borman
Cahouet
Kuwait
Diego
Hathaway
Stoltenberg
Erhard
Rifkin
Toy
McGovern
Singleton
Kemp
Kollmorgen
Lyon
Khoo
Cyprus
Secord
WOW
Ramada
Pretoria
Philadelphia
Southam
Deere
Vernon
Tektronix
Fleet
Toyota
Kelso
Hofmann
Crowe
Daisy
Kaiser
Salk
ABC
Algoma
Intelsat
Turkey
LyphoMed
Gay
Shin
Sematech
Emerson
Amerman
Pen
Recarey
Redford
Par
Spiegel
Pravda
Chiles
Hanson
Tehran
Carrington
Aspen
Fermenta
Sumita
Chester
Matisse
Ing
Marriott
L.A.
Menem
Corning
Napoleon
Schweitzer
Chinn
Dworkin
Cabot
Revere
Esprit
ICI
Heico
Perelman
Martino
Bilzerian
Kasparov
Helsinki
Ethiopia
RJR
Michigan
TJX
Hess
Klerk
Gephardt
Uruguay
Chirac
Amsterdam
Yokohama
Cuomo
Hampton
Echos
Lasker
Torstar
Connaught
Statoil
Amax
Epeda
BCCI
AT&T
Valero
Zia
Marlboro
Helena
Brockway
Bancroft
MCI
Privatization
Zurich
Royster
Jaruzelski
Belgrade
Ellington
Brunei
Leigh
Genentech
Coca-Cola
Nalcap
Fiji
Unita
AEG
Georgia
Valeo
Essex
Bevill
Deltona
MacArthur
Arafat
TW
BP
Lindner
Televisa
Timken
Clarendon
Sensor
Steinhardt
Omaha
Milken
STC
Frist
Carlton
Kissinger
Kenya
Bonner
Greenspan
Benetton
him
TRE
Wasserstein
Yeltsin
Taiwan
Manac
Keaton
Chiat/Day
Brant
Lubensky
MiniScribe
Schwab
Brazil
Saturn
Massachusetts
TWA
Cardenas
McGowan
Truman
Hyundai
Hesston
Snyder
Oregon
Chihuahua
Martell
Colgate
Glenn
Burma
Amdahl
Henkel
Emery
Millard
Yellowstone
Wallach
Sears
Bath
Sherwood
Francisco-based
Teets
Islam
Goldwater
Nuys
Meese
Auschwitz
Blair
NutraSweet
Wyden
Yugoslavia
Inman
Algeria
Hilton
Kincaid
Dominion
HealthVest
Karcher
Speakes
conspicuously
downright
unexpectedly
someone
powerfully
relentlessly
exceedingly
militarily
free
harder
socially
intellectually
unusually
slowly
albeit
bankrupt
grossly
Particularly
statistically
doubly
infinitely
headway
excessively
vastly
Very
somewhat
anything
truly
fiercely
distinctly
stubbornly
utterly
strikingly
increasingly
criminally
notoriously
awfully
head-to-head
medically
genuinely
easier
unconvinced
confident
back
Right
very
impossible
too
immensely
wildly
solidly
unscathed
credence
mutually
totally
somewhere
artificially
sufficiently
blatantly
uniformly
workfare
extraordinarily
inherently
emotionally
curiously
fatally
wonderfully
quite
differently
pretty
how
persistently
Attention
critically
Sooner
everybody
damned
Equally
sure
mildly
remotely
ill
strategically
spectacularly
anytime
uniquely
unnecessarily
terribly
overly
potentially
brutally
abnormally
financially
Please
nothing
environmentally
surprisingly
scientifically
intensely
perfectly
comparatively
appropriately
so
visually
decidedly
exceptionally
enormously
seemingly
moderately
relatively
something
chemically
morally
unduly
sexually
cautiously
deeply
materially
sour
incredibly
intact
unanswered
hugely
tremendously
remarkably
woefully
fairly
physically
Not
anywhere
Always
like
Too
entirely
completely
commercially
oddly
brightly
everyone
purely
densely
admittedly
psychologically
everything
overtime
politically
chronically
dangerously
equally
namely
guilty
fundamentally
enough
profoundly
strictly
economically
technologically
extremely
patently
reasonably
ideologically
prohibitively
disproportionately
Taken
hopelessly
havoc
undetected
is
remains
strengthens
lacks
means
beats
enhances
paves
contradicts
Imagine
looks
cares
bolsters
symbolizes
illustrates
reflects
becomes
misses
proves
Was
underlines
possesses
sounds
reinforces
Is
contemplates
upholds
entails
underscores
indicates
silver
look-alike
particle
pacemaker
peace
A-2
fat
baggage
leftover
M2
derivative
resale
braking
palladium
highway
platinum
homicide
obscenity
guidance
ingot
prostitution
withholding
auction-rate
non-oil
policing
nickel
DDC
rehabilitation
diaper
austerity
orange
crushing
goodwill
cold
variable
Nagorno-Karabakh
price-fixing
polymer
luxury
neon
troop
lip
routine
bridge
Shadow
bellwether
chicken
blockbuster
GNP
Watergate
clay
rust
OS/2
tritium
Chancery
Lombard
migraine
gasohol
fruit
yogurt
2200
oatmeal
and/or
Jaffna
indemnity
overheating
potato
uniform
monoxide
bleach
maximum
export
razor
cocaine
milk
mileage
LBO
Appeals
disability
postage
gasoline
Hog
hypertension
stock
dissenting
soda
disinformation
best-seller
input
preference
VCR
literacy
defamation
circuit
coke
ADR
cocoa
cooperative
tractor
supercomputer
coffee
budgeting
upright
Spot
extradition
seed
low-calorie
secondary
embezzlement
orphan
CFC
gender
diligence
import
souvenir
bargaining
heating-oil
billing
urine
decision-making
paperback
Supreme
commodity
absenteeism
condominium
salt
chlorine
grain
garbage
secret
abortion
merchandise
core
Wheat
aspartame
cattle
capital
copier
flower
key
evil
accessory
Kevlar
submarine
recycling
asset
PC
infant
foreclosure
complex
SDI
meat
emigration
ham
hardball
Y
birth
Prime-1
confidentiality
model-year
banana
breeding
wage
oxygen
mortality
unemployed
employment
household
referral
dioxide
forbearance
weakest
bribery
Awacs
toilet
laundry
nicotine
groundwater
discount
RICO
Monopoly
laser
2722.42
1-2-3
outward
computing
surrogate
abalone
MS-DOS
overheated
minoxidil
Eurosterling
barbecue
fluid
fairness
futures
alien
smallest
dystrophy
copper
parallel
alumina
P-E
worldwide
arms-sales
molding
acne
turkey
impeachment
spreadsheet
aerosol
sugar
proficiency
B-1
Seven
belly
resettlement
cholesterol
fuel
Taxation
cheapest
HDTV
silicon
UDAG
IPO
F-18
equity
appropriations
bond
radar
apple
fabrication
stamping
ATM
payroll
wheat
tomato
tariff
apartheid
royalty
influence-peddling
Crude
district
retraining
breast
vanilla
annuity
softball
appeals
electron
heroin
smog
B-2
high
hay
lemon
money
emergency
tar
ARM
disabled
subscription
Unix
entitlement
arms
prepayment
prostate
cassette
bourbon
prescription
savage
vintage
sex
lending
Scout
seniority
budget
acid
disinvestment
staffing
tooth
2100
pass-through
savvy
buffer
downstream
break-up
metal
double-A
information
PPP
juice
brake
beef
sulfur
indemnification
rich
stabilizing
unemployment
incineration
musical
propfan
liver
depositor
NMS
A-6
Platinum
laptop
Seco
tax
fertility
refunding
deficiency
hydrogen
set-aside
wire
short-selling
verification
uninsured
perjury
intraday
quotation
spot
reciprocity
slack
DNA
interbank
methanol
methane
reservation
newsstand
defense
poverty
colon
yuppie
bullion
greenmail
arsenide
start-up
price/earnings
kickback
copyright
zero
CD
deposit
insulin
half-year
arson
tuition
radon
pesticide
gravel
fringe
Smoot-Hawley
unconditional
cotton
ketchup
formaldehyde
surveillance
crude-oil
hog
burial
Ethics
entree
EPO
car
inventory
poor
prairie
Prime-2
bonding
timberland
unified
custom
pollution
F-16
captive
convenience
bankruptcy
Midgetman
zoning
emission
extortion
estrogen
rice
bookkeeping
freezing
communication
credit
arbitrage
debenture
diamond
money-laundering
Remic
potential
bull
barter
installment
containment
Gramm-Rudman-Hollings
mass
Sentra
severance
modeling
asthma
truck
R&D
surf
P/E
GM-10
stimulus
radiation
ice
DRAM
precision
wildlife
ivory
chip
subcompact
Wage
minimum
maternity
voter
VAT
low
ozone
libertarian
honey
arbitration
ventilation
Escort
workstation
origination
subscriber
lawn
inside
M1
calcium
limestone
farm
upfront
benchmark
pornography
open-air
dropout
ethanol
electricity
overhead
solvency
gold
telex
grape
benzene
IRA
Worse
Overall
PRIME
Separately
.
Yaobang
Harley-Davidson
Admiral
Claiborne
Tidewater
Bancshares
Communications
Valhi
Advisers
Shopping
Tonka
Treatment
Chesebrough-Pond
Theatre
Fields
Marubeni
Furniture
Inns
Edison
Wars
Paradyne
Workers
Foremost
Lockheed
Regency
Test
Town
Interleaf
Operations
Assurance
Broadcasting
Sciences
Industries
Magazine
Shoppes
Ultrasystems
Dekalb
Loom
Vista
Falls
Bombardier
Walgreen
Aluminum
Network
Steel
Renouf
Communication
Health
Distillers
Mobil
Distributors
Newsday
Cazenove
Land
Artists
maker
Meet
Car
Construction
Wire
Electrolux
ConAgra
FMR
Lomas
Apparel
Attendants
Govett
Plus
Owners
Productions
Chevron
Chesapeake
Papers
Ampco-Pittsburgh
RCA
Response
Novell
Bridgestone
Mineral
Hanover
Cafe
NWA
League
Conversion
Egghead
Institutions
Mine
Toshiba
Press
Nabisco
Cambrian
CIP
Point-Pepperell
Appeal
Science
Rate
Little
Paper
Suisse
Anheuser-Busch
Trailways
Trinova
Doubleday
Minnetonka
Harper
Instinet
Emhart
Motors
Chemicals
Economics
Main
Project
Evening
Genetic
Nationwide
Kinder-Care
Star
Oaks
Hills
Centocor
Learjet
Advertising
Symbolics
Province
Fuel
Discount
Stage
POWER
Zale
Dynamics
BANK
Clubs
Transamerica
Basin
Bankshares
ASA
Citizens
ICH
HealthCare
Butcher
Counsel
Mitel
Lafarge
Resorts
Assembly
Lufkin
Enterprises
Breweries
Homestead
Terminal
Bar
Holiday
NV
Baer
Scanning
Plastics
Flats
Xerox
Partnership
USX
Trucks
Switch
Ingersoll-Rand
Empire
CSX
Pak
Colman
Analysis
Systemhouse
Laser
NEC
Industrie
Procter
PaineWebber
Derby
Bros
Chicken
Sutro
Celanese
Donuts
Peng
Electron
Command
Dunkin
McGraw-Hill
Centronics
Scottish
Hospital
Banks
Bowater
Card
Hambrecht
Tribune
MacAndrews
Nucor
Learning
Teradyne
unit
Films
Microsystems
Express
Pride
Melville
Order
Authority
Cooperative
Boat
Yard
Danaher
Table
Coal
Greetings
Monitor
Studies
Alliance
Chips
Kane-Miller
Fitness
Harsco
Arms
Homes
International
Scripps
Shuttle
Intermark
Telepictures
Ericsson
Cooperation
Academy
Responsibility
BankEast
Hollinger
Centre
Ave.
Instruments
Ameron
Club
Gardens
Chyron
Toys
Conference
Resort
Dunlop
Video
EMI
Heart
Marathon
Dunes
Mission
Village
Reader
Carriers
N.A.
Dataquest
Lady
Valdez
Centers
Transmission
Foods
Iberia
Brown-Forman
Park
Noranda
Seiko
Memories
Xidex
Villa
Growth
Oil
Dylex
Sports
Dun
Acceptance
Ranger
Agreement
Arts
Britannia
Coopers
Merchant
Foundation
Hut
Logic
Telecommunications
Leu
Family
Square
Boulevard
Bresler
Developments
L.P.
Diversified
Biotechnology
Loral
AMP
Library
Letter
Keegan
Lorimar-Telepictures
Cartier
Plans
Warehouse
Management
Gear
Hercules
Employees
Lauderdale
K.K.
Color
Contel
Nortek
Healthcare
LP
Shipbuilding
Scholastic
Battle
Comcast
Studios
RTZ
Masco
Ecolab
Equity
Policy
Ahmanson
Reading
Tracor
Insight
Paccar
Grow
Spring
Realty
States
UIS
Alleghany
School
Coalition
Spectra-Physics
Louisiana-Pacific
Courier
M/A-Com
Systems
Recovery
Capital
Account
mart
Asarco
Art
Volkswagen
Fabrics
Tire
MLX
Viratek
Putnam
Upham
Assistance
Avco
Steelworkers
Shipyards
Textron
Imasco
Clearing
Ajinomoto
Mabon
Ranch
Deacon
Ballet
Marine
Harbor
Design
Mountain
Area
Piper
Building
Expansion
Electronics
Electric
Domtar
Whampoa
Administrators
Dry
Resolution
Observer
Quest
C3
Torchmark
Hocking
Meagher
Sirrine
Varity
Brae
Forum
Holding
Schering-Plough
University
Barrick
Cement
Group
Hutton
Organization
Aerospatiale
Illustrated
Odeon
Isomedix
Savers
Reinsurance
BSN
Sea-Land
Tower
Fargo
Hydro
Bureau
Properties
subsidiary
Harriman
College
Clabir
GTE
Hooker
CalFed
Bros.
Boeing
Accident
Genetics
Angels
Days
Ink
Marwick
Read
Matthews
Circle
Linde
Businessland
Lighting
Pictures
Shack
Engelhard
Optical
MidCon
Trans-Resources
Mattress
Georgia-Pacific
Dealer
Diamond-Bathurst
Support
Albany
INTERNATIONAL
Leasing
Heritage
Guaranty
News
Beacon
Networks
Volvo
Unisys
Law
Excel
Cargo
Saatchi
Nekoosa
Council
Mobile
Programs
Television
Chip
D.S.
Hurdman
Aid
Helicopter
Gypsum
Milacron
Telecom
Lyonnais
Bausch
Chronar
Batus
Mail
Creek
Metals
Endotronics
Packaging
Carbide
Cleveland-Cliffs
Mill
Distribution
LTD.
Richardson-Vicks
Vickers
Sysco
Supply
Equities
Curtain
Imperial
Minerals
Intermedics
Register
AS
Brewery
Coastal
Barn
Otsego
Ciba-Geigy
Sachs
Roundtable
Delaval
Cars
Renaissance
Society
Sector
Restaurant
Pharmaceuticals
Software
Supermarkets
Castle
Refuge
UtiliCorp
Eagle
Tele-Communications
Gruntal
Mall
Bancorp
Romeo
Challenge
Duff
Telephone
McKinsey
Ludlum
Amusements
Lease
Exporters
Kimberly-Clark
Shriver
Laboratories
Line
Satellite
Survey
Babcock
Centennial
Rock
Intergroup
Enserch
Tech
Theater
Credit
Worldwide
Ventures
Fenner
Cushman
Fanuc
Film
Fluor
Purina
Ziyang
View
Springs
Week
Grenfell
FMC
Services
Douglas
Goods
E-Systems
Imaging
Refractories
Voltage
CNW
Victoire
Times
Reynolds
Lumber
Products
Metex
Marsh
Lynch
Olympia
Fidelcor
Gtech
Telesis
Flexi-Van
Geldermann
Partners
Brothers
Topeka
Atlantis
Travel
Philips
Success
Entwistle
Newmark
Transit
Youth
Access
Nugent
Builders
Econometrics
Consultants
Cards
PepsiCo
Life
Trading
Complex
Cablevision
Accountants
Rail
Garden
KDI
Nutrition
Loews
Digest
Gallery
Haskins
Nations
Center
Cream
Weekend
Aluminium
Heights
Bendix
Physicians
Pipeline
archrival
PLC
Gundy
Knight-Ridder
Interstate
Lampoon
Ionics
Education
DFS
Phibro
Entertainment
Instant
Branch
Beckman
Steamship
Atlantic
Acton
Cable
Technology
Hazeltine
Microelectronics
Bayly
Donnelley
Bay
Surgical
Chartered
SA
Ridge
Processing
Finanziaria
Camera
Mines
Governors
Pioneer
Yankee
Strategies
On-Line
Bruyette
Mills
Weyerhaeuser
Book
Markets
Spectrum
Cyanamid
Pharmaceutical
Nynex
Owens-Illinois
Lion
Parts
Baldwin-United
Funding
Museum
Rhone-Poulenc
Automation
Intercable
Westvaco
Cessna
Semiconductor
Airways
Conseco
Players
Ogilvy
Container
Technologies
Thermedics
Scotia
Electro-Biology
Roebuck
Records
Hadson
Colgate-Palmolive
Citizen
Bechtel
Sperry
Acquisition
Stelco
Institute
Primark
Rothschild
Lukens
Associates
Robinson-Humphrey
Testing
Airplane
Pulp
Computer
Gelco
Southmark
Shipping
Mortgage
Hotels
Mentor
Drilling
Computers
Railroad
Honeywell
Festival
Brewing
Merieux
Syntex
Soup
Stores
Canrad
Intel
Alltel
Yield
Emirates
Missiles
Canaveral
Reckitt
Motor
Concepts
Progress
Algom
Wertheim
Freight
Advisors
Ryobi
Tate
Hitachi
Adia
Petroleum
AVX
Water
Worth
Abitibi-Price
Thrifty
Pacific
Fiberglas
Review
Century
Assessment
Stanley
AMR
Store
TRW
Xiaoping
Engines
Ladenburg
Schlumberger
Mart
Siegler
Host
System
Energy
Herald
Process
Bofors
Palace
Aircraft
Reserve
Aero
Drive
Seafirst
Care
Avalon
Guarantee
Bowes
Passage
Chemical
G.m.b.H.
Range
Publishers
Bosworth
Dreyfus
USA
Diesel
Association
Echlin
Program
Bank
Allis-Chalmers
Dataproducts
Forest
Sonat
Stadium
Lorillard
Northwest
Freeport-McMoRan
Houses
Matthey
Merchandise
Baseball
Rohm
Shoe
Opinion
Arrow
Lines
Sugar
RepublicBank
Wedd
Valley
Controls
Executive
Pfizer
Frontier
Mining
Consolidated-Bathurst
Investing
Plant
Investments
Dock
Yamaha
Projects
Boots
Fibreboard
Freres
Bloedel
Perspective
Advest
Books
Fair
Medtronic
RTE
Production
Laboratory
Schweppes
INDUSTRIES
Materials
Outlook
Refining
Power
Ricoh
Emulex
Banker
Teledyne
MIM
Crescott
Med
Textile
Property
Comdisco
Horizons
Trucking
Leisure
Labs
Railway
Division
Holdings
Itel
Horn
Financial
Tambrands
Lawyer
Machinery
Charter
Cargill
Photo
Cascade
Daily
Celeron
Laing
Instrument
COMMUNICATIONS
Tool
Graphics
Brunswig
Team
Nova
Research
Temple-Inland
Portfolio
Rite
Immunex
Pont
Factors
Winners
Airlines
Raychem
Black
Facility
3Com
Thalmann
Music
Bell
BANCORP
Utilities
Mediq
CTS
Fruit
Grumman
Cominco
Savings
Arkla
Record
Stearns
Plaza
Plains
Kingdom
Motorola
Signal
Investors
Moines
Engineers
OIL
Bridge
Tunnel
Affiliates
Copper
Biosystems
Institutes
Age
Manufacturing
Engine
Asamera
Service
Rentals
Bottling
Nerco
Engineering
Ernst
Communities
Pool
727
Apache
Voice
Tobacco
Magnetics
Wharf
Wine
Southwest
Settlement
Tape
Penney
Intermediate
Gas
Components
Montagu
Station
Eaton
Study
Beverage
Armco
RESOURCES
Multifoods
Inn
MAN
Confederation
CO.
Norwest
Sealy
Shawmut
Schroder
Tracinda
Richfield
Pall
Cambior
Ferro
Gaming
Stanadyne
Ladies
Machine
Cinema
Insurance
Office
Bancorp.
AB
Hotel
Standards
Data
Vuitton
Yellowknife
Cetus
Olmstead
Nugget
AG
Pratt
Elsinore
Brands
P&L
Arena
N.V.
Komatsu
Litigation
Ropak
Lifetime
Trustcorp
SYSTEMS
Devices
Marietta
GATX
Institution
Wings
Lambert
Hoechst
Cone
Fire
Midlantic
Petrofina
Vision
Hannifin
Symphony
Guardian
Flight
Endowment
FINANCIAL
Illuminating
Ayer
Acquisitions
Maxtor
Rent
Thiokol
Federation
Printing
Merchants
Aerospace
Crum
Needham
Oppenheimer
Boston
S.P.A.
Diasonics
Standard
Kokan
Factory
Allied-Signal
Marketing
Enron
EG&G
Culbro
Peabody
Economy
Dog
Forge
Brunswick
GAS
Cos.
Conoco
Pincus
McCann-Erickson
Americana
BCE
GROUP
VF
S.p.A.
Cardis
Raytheon
Publishing
HAL
IXL
Automotive
Us
Treaty
Grain
Noxell
Lakes
Cogeneration
Airport
Farms
Crisis
Growers
Federal-Mogul
Deer
Travelers
Warburg
Cascades
Grande
Meridian
Financing
Exploration
Meat
Exxon
Jewel
Gate
PipeLines
Dietz
B.V.
Wide
Estate
Jovanovich
Edge
Beach
Orchestra
Equipment
Biscuits
Works
Strategy
ELECTRIC
Sony
Trust
Bull
Settlements
Teachers
CooperVision
Opera
Mirror
Refco
Freedom
Knudsen
Mid-America
Bache
Kerr-McGee
Cigna
Rapid-American
Publications
Development
Stop
Republic
Resources
Fund
Applications
Rodman
Cities/ABC
Trustco
Boveri
Cities
Stroock
Microwave
Restaurants
Limited
Magazines
Columbia
Newspapers
Rand
Versatile
Transport
Jazz
Weekly
Planters
Jaffray
Berkeley
Welbilt
Precision
Brotherhood
Verex
Safe
Clinic
Corporation
Rolls-Royce
Petro-Canada
Wis
Radio
Windmere
Machines
plethora
flood
bonus
filibuster
Cost
buy-out
result
mixture
string
array
springboard
Return
coaster
deluge
correction
collision
flurry
compilation
harbinger
cutoff
degree
badge
byproduct
backdrop
portrait
victim
precaution
rarity
charge
believer
distraction
pattern
watershed
grin
cluster
feast
whiff
blip
reservoir
component
revaluation
couple
bunch
indicator
precursor
turnaround
hoax
hassle
scapegoat
chorus
paycheck
smile
fraction
replay
fluke
parody
torrent
barometer
reassessment
narrowing
cup
southeast
basket
mistake
rehearing
hodgepodge
wedge
critique
dent
sucker
cease-fire
recapitalization
symptom
majority
impact
blizzard
peek
advantage
sense
bundle
host
prerequisite
pretext
portion
prototype
sham
breakdown
lot
prisoner
total
pooling
heck
radius
contraction
takeover
lockup
southwest
pair
chunk
handful
workaholic
carry-forward
continuation
tailspin
defender
series
toast
misunderstanding
patchwork
rundown
counteroffer
reflection
litany
rash
violation
profit
task
mainstay
barrage
foreigner
handicap
referendum
compromise
batch
consensus
recession
wimp
stroke
sentence
breather
rebuttal
reversal
surprise
handshake
fine
write-off
gesture
reaffirmation
consolation
sensation
cadre
imitation
bang
outflow
hint
haven
glimpse
reproduction
reminder
chord
dime
respite
variety
shambles
shortage
effect
row
raft
reprieve
shred
ransom
flattening
succession
penny
nuisance
rerun
rebate
lockout
recurrence
damper
range
tug
resurgence
windfall
sampling
comeback
breakthrough
slackening
photograph
uptick
jar
shadow
repetition
knack
pick-up
cover-up
worth
bit
gain
piece
sigh
shame
mistrial
sample
buyout
northwest
tenth
dose
clarification
northeast
summary
vengeance
consequence
prophecy
staple
cannon
triumph
gift
carrot
slice
write-down
slew
wheelchair
pall
copy
splash
pillar
lid
loss
realignment
bottle
vindication
softening
Summer
via
Maturing
inflation-adjusted
hoc
of
'n'
Banc
finally
together
downhill
predictably
vehemently
correctly
reluctantly
essentially
historically
prominently
unanimously
freshly
elsewhere
kindly
afterwards
positively
publicly
generously
triple-A
widely
wisely
abruptly
routinely
aggressively
silently
individually
abroad
himself
smoothly
theirs
previously
literally
constantly
WHEN
variously
aptly
intimately
backwards
unilaterally
grudgingly
currently
instantly
whatsoever
When
wrongly
inadvertently
momentarily
forever
myself
unfairly
evenly
purportedly
greatly
gradually
personally
specifically
frantically
invariably
herself
suddenly
seriously
centrally
severely
now
nationally
extensively
commonly
instinctively
urgently
whoever
decisively
warmly
accidentally
comfortably
Whenever
desperately
accurately
practically
again
single-handedly
universally
awhile
domestically
Gainers
bitterly
thereafter
nowhere
usually
deliberately
apparently
technically
evidently
markedly
rarely
normally
formally
whenever
regularly
apart
expressly
sometimes
locally
faithfully
beautifully
overwhelmingly
thoroughly
typically
lavishly
improperly
whereby
radically
Nearby
broadly
allegedly
delicately
double-A-1
tightly
jointly
openly
recently
realistically
profitably
supposedly
merely
furiously
nicely
naturally
skillfully
firmly
inexorably
peacefully
precedence
anew
wholly
eagerly
ourselves
double-A-3
privately
dutifully
amply
arbitrarily
frequently
progressively
independently
Wherever
handily
geographically
skeptically
voluntarily
simultaneously
directly
anymore
gingerly
badly
modestly
permanently
awry
consequently
squarely
carefully
thinly
continually
brilliantly
immediately
secretly
traditionally
prudently
attractively
nominally
forth
themselves
vaguely
competitively
partially
alive
quietly
occasionally
Twice
generally
soundly
informally
nowadays
reportedly
internally
unwittingly
understandably
Formerly
thereby
illegally
gracefully
hastily
originally
loudly
afterward
indefinitely
overboard
semiannually
passionately
Losers
implicitly
loosely
exclusively
Later
strongly
often
favorably
collectively
boldly
fully
adversely
lightly
neatly
anxiously
altogether
dramatically
significantly
'em
what
subsequently
nervously
automatically
roundly
staunchly
hers
fraudulently
vigorously
accordingly
Instead
safely
electronically
plainly
responsibly
harshly
racially
officially
globally
beforehand
temporarily
willingly
negatively
steadily
effectively
violently
actively
randomly
consistently
awake
Me
finely
vividly
abundantly
annually
quickly
sorely
handsomely
wherever
Deregulation
emphatically
rapidly
intentionally
substantially
briskly
knowingly
gently
conservatively
initially
casually
ostensibly
backward
properly
ever
Simply
single-A-1
which
enthusiastically
unquestionably
richly
noticeably
visibly
falsely
cheaply
bluntly
dearly
lately
heavily
politely
satisfactorily
retroactively
explicitly
similarly
purposely
swiftly
steeply
hotly
drastically
systematically
everywhere
wrongfully
where
customarily
continuously
seldom
promptly
convincingly
calmly
selectively
freely
prematurely
yourself
happily
separately
hence
forcefully
Hardly
internationally
coolly
mysteriously
professionally
asleep
Soon
conveniently
successfully
unchecked
willfully
periodically
narrowly
manually
readily
poorly
clearly
pleasantly
anyway
here
belatedly
Throughout
Over
Knowing
Without
Until
At
Following
Reflecting
Concerning
For
Fearing
On
Pending
By
Like
Citing
Under
Notwithstanding
Through
Among
Despite
In
From
Including
Toward
Within
Excluding
Upon
Between
After
Across
Given
Before
Besides
Amid
During
Around
months
centuries
quarters
minutes
inches
seasons
weeks
days
installments
summers
innings
years
generations
seconds
hours
Years
decades
sessions
Shortly
per
whopping
vs.
Than
versus
plus
minus
or
totaling
*
exceeding
Subcommittee
sidelines
planet
street
Bloc
downside
bloc
podium
skyline
Doctrine
ink
woods
suburbs
Koran
bush
heartland
valley
gym
barracks
populace
limelight
lion
coast
sun
Exchequer
gulf
subcommittee
prison
junta
border
river
Antilles
economy
airwaves
bureau
market
Coast
pedal
Zoo
marketplace
Legislature
legislature
hemisphere
W-4
towel
Continent
exchange
Pole
prowl
courtroom
Committee
peninsula
electorate
Constitution
bloodstream
globe
Court
sky
affair
parliament
countryside
Embassy
CreditWatch
region
townships
Side
floor
caucuses
presidency
stratosphere
ghetto
scandal
Euromarkets
workplace
fray
seas
disgust
psyche
bench
trenches
continent
peso
pit
ballot
bandwagon
Code
disarray
slums
Slope
coasts
spotlight
code
transaction
playoffs
tech
courthouse
earth
Hemisphere
CPI
basin
Strip
sidewalk
stump
Parliament
senate
iceberg
receivership
tourney
sector
newsroom
court
republic
fret
concede
insist
allege
argue
contend
warn
complain
believe
reckon
say
predict
suggest
acknowledge
assert
indicate
concur
speculate
Supporters
Agencies
Producers
pollsters
Specialists
historians
conferees
Readers
strategists
shipbuilders
Authorities
Doctors
Politicians
Researchers
officials
observers
Friends
attorneys
meteorologists
presidents
legislators
Developers
participants
spokesmen
critics
Documents
Directors
investigators
economists
administrators
Entrepreneurs
Africans
Scientists
traders
Prosecutors
justices
dealers
planners
Courts
associates
skeptics
Buyers
Executives
Soldiers
Decisions
Competitors
Retailers
Koreans
aides
optimists
forecasters
Plaintiffs
Colleges
Individuals
Students
marshals
Clients
Managers
bankers
Surveys
specialists
Aides
authorities
Viewers
negotiators
Persons
Pakistanis
lawmakers
bailing
Governments
Containers
Traders
consultants
diplomats
Sellers
Regulators
researchers
educators
Brokers
analysts
Arbitragers
Others
cattlemen
Polls
Analysts
Creditors
Advocates
experts
Users
Economists
Sources
pundits
prosecutors
Proponents
Contractors
Officers
staffers
Critics
Officials
Advertisers
commentators
brokers
defenders
watchers
Residents
Agents
Observers
proponents
Passengers
legislatures
reporters
Reporters
Insurers
Businessmen
scientists
partisans
sources
Dealers
executives
Experts
Participants
professionals
Investigators
examiners
Diplomats
Lawyers
insiders
People
Witnesses
Police
Legislators
regulators
chemists
Insiders
recruiters
Can
Would
Could
'll
'd
can
cannot
shall
Let
45,000
1.19
43,000
1.80
543
2.05
2.125
132
12.75
790
1.88
2.20
3.23
490
3.38
146
236
4.375
435
211
1,900
134
665
10.125
108
3.05
32,000
2.61
2.46
1.84
38,000
65,000
9,000
272
190
35.3
3.90
160,000
44.7
280,000
2.27
2.44
50-a-share
1.17
261
138
10.50
1.79
2.67
2.22
513
515
625,000
960
1.76
23,000
316
2.60
3.625
544
37,000
75,000
260,000
1.61
2.98
1.14
3.87
216
269
29.25
1.35
217
13.25
3.17
525
3.25
4.45
512
307
195
42.4
27.50
15.75
2.65
247
19,000
1.02
12,000
18.95
3.14
3.34
740
35.8
197
1.21
3.42
1.13
1.90
125,000
2.31
730
246
33.50
200
12.625
21.75
1.64
193
233
1.56
1,400
16.875
100,000
344
12.875
140,000
395
46.8
1.24
9.50
1.72
30.50
1.37
144
459
3.46
39.9
650,000
268
210
650
36.4
1.54
2.50
175
14.50
2,200
17.95
467
825
226
24.1
3.33
1.875
27.75
575
28.50
470
22.9
225,000
2.38
40.50
2.45
925
30.25
204
3.51
192
178
1.34
2.23
1.25
125
2.90
17,000
3,000
trillion
3.02
approximately
130
14.875
408
15.625
198
1,500
36,000
850,000
775
345
356
42.2
16,000
153
2.51
199
6.375
15.125
335
1.77
270,000
30.2
375
715
metric
47.50
4,500
135
1.18
230
334
31.75
18.50
1,100
32.25
2.21
2.06
12.375
4.25
430
221
296
600,000
12-a-share
18,000
289
1.11
2.30
209
57,000
508
300
3.30
2.02
200,000
3.16
347
385
1.44
14.375
139
1.22
2.16
1.73
2.15
333
340,000
168
180,000
475
7.625
3.15
1.23
2.95
2.77
535
173
720
135,000
47-a-share
455
23.25
510
4.02
418
28-a-share
2.76
32.8
1.94
452
31,000
340
680
6.625
2.12
1.26
970
880
312
2,500
42,000
4.625
35.25
US
1.06
156
11.625
8,000
950
186
14,000
2.72
300,000
228
1.96
2.39
1.67
245
530
1,700
670
350
1.86
2.25
2.49
223
415
540
239
219
90,000
1,000
3.03
1.71
174
2,100
285
1.27
2.01
700
326
635
2.08
120,000
3.875
500
176
760
600
1.70
30.75
33,000
29.50
580
3,700
625
25.50
450,000
3.44
780
2,800
410
2.07
337
2.43
265
2.62
1.47
billion
5,500
3.28
354
367
330
1.07
30,000
115
1.125
2.96
2.52
1.36
2.59
450
185
250
263
2.34
27,000
3.80
1.31
400
2.35
115,000
640
3.40
1.69
22,000
35,000
6,500
1.01
4.55
700,000
365
256
2.84
260
23.50
14.625
2.55
48,000
28.75
13.125
3.26
810
1.78
440
750,000
2.68
9.75
34.25
1.59
30.4
147
140
25,000
310
2.93
2.64
384
279
1.41
1.74
48.50
4.65
1.83
349
1.99
Million
1.81
1.92
4.50
21.50
15.25
610
387
2.88
1.57
41.4
545
258
5.50
380
1.98
1.28
23.75
8.625
31.50
409
1.93
10.875
1.66
830
2,400
1.46
17.75
65-a-share
47,000
218
275,000
19.95
54,000
26.9
4.40
17.875
1.05
40,000
1.40
275
2.75
85,000
253
620
190,000
44-a-share
117
30-a-share
3.12
7,000
60,000
14.75
2.82
590
11.875
2.32
205
1.42
30.3
1.04
1.68
3.75
62,000
220,000
2.40
2.56
billion-a-year
apiece
170
248
360
900
16.50
175,000
3.55
273
9.625
18.875
143
181
3.32
1,200
3.13
370
3,500
224
17.25
1.45
150,000
188
52,000
11.125
3.35
20.25
2.73
1,250
4,300
12.125
400,000
800
10-a-share
660
194
570
44,000
2.19
2.13
690
55,000
165
28.2
2.37
53.9
26.25
255
148
310,000
1.08
45-a-share
360,000
630
26,000
800,000
25.75
875
1.29
460
6.125
2.24
4,600
20.50
15,000
2.53
1.50
252
950,000
9.875
110,000
5.23
35.50
130,000
2.04
11.50
21,000
36.50
283
18.25
41,000
27.25
2.09
222
4.125
4.15
203
282
2.66
53.8
26.50
16.125
4,800
1.10
2.14
1.38
305
220
3.65
3.21
2.10
930
10,000
3,600
325,000
12.25
2.18
264
1.20
320
271
126
2.48
295
860
4.20
675
1.15
750
20,000
1.60
227
251
215
9.375
1.52
20-a-share
70,000
1.91
24.75
2.33
2.375
355
235
325
million-a-year
19.50
3.125
241
2.63
41.1
1.09
675,000
3.45
1.82
4.80
171
820
485
29,000
14.25
25.25
8.875
2.80
1.87
22.75
1.30
10.625
206
243
24,000
million
70-a-share
1.32
240,000
230,000
2.42
2.47
2.875
900,000
63-a-share
39.7
2.41
